In [3]:
# Q.1 List any five functions of the pandas library with execution.
import pandas as pd 
data = pd.read_csv('plsyers_data.csv')

In [11]:
data.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035

In [22]:
data['Age'].dtype

dtype('O')

In [23]:
data['Age'] = pd.to_numeric(data['Age'], errors='coerce')

In [24]:
data1 = data[data['Age'] > 30]

In [25]:
data1

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
12,11,Tony Allen,SG,33.0,MEM,63,41,1648,225,455,...,.627,103,177,280,86,129,30,86,166,539
14,13,Lou Amundson,PF,32.0,TOT,53,35,937,109,255,...,.471,94,174,268,70,22,52,62,126,259
15,13,Lou Amundson,PF,32.0,CLE,12,0,79,4,12,...,.600,5,15,20,5,1,0,5,11,11
16,13,Lou Amundson,PF,32.0,NYK,41,35,858,105,243,...,.463,89,159,248,65,21,52,57,115,248
17,14,Chris Andersen,C,36.0,MIA,60,20,1132,120,207,...,.667,76,223,299,43,26,61,40,88,320
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
631,463,Gerald Wallace,SF,32.0,BOS,32,0,286,14,34,...,.400,17,40,57,11,15,4,18,19,35
637,469,David West,PF,34.0,IND,66,66,1895,323,686,...,.739,108,341,449,223,48,48,120,160,769
650,480,Mo Williams,PG,32.0,TOT,68,33,1980,341,860,...,.872,22,152,174,424,46,14,172,162,964
651,480,Mo Williams,PG,32.0,MIN,41,19,1149,180,447,...,.851,13,85,98,261,30,8,102,103,499
652,480,Mo Williams,PG,32.0,CHO,27,14,831,161,413,...,.892,9,67,76,163,16,6,70,59,465

In [26]:
#Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
#     DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [27]:
import  pandas as pd

In [30]:
def reindex_dataframe(df):
    new_index = range(1,len(df)*2,2)
    df.index = new_index
    return df

In [31]:
data = {'A':[10,20,30],
        'B':[40,50,60],
        'C':[70,80,90]}
df = pd.DataFrame(data)

In [32]:
df = reindex_dataframe(df)

In [33]:
df

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

In [34]:
#Q.3 Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
# iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
# function should print the sum to the console.
# For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
# calculate and print the sum of the first three values, which is 60.

In [35]:
data1 = {'Value':[10,20,30,40,50,60]}

In [37]:
df = pd.DataFrame(data1)

In [42]:
def calculate_sum_of_first_three(df):
    column_value = df['Value']
    sum_of_first_three = column_value.head(3).sum()
    print("SUM :",sum_of_first_three)

In [43]:
calculate_sum_of_first_three(df)

SUM : 60

In [1]:
# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
# 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [39]:
import pandas as pd

def count_words(text):
    return len(str(text).split())

def add_word_count_column(df):

    df['Word_Count'] = df['Text'].apply(count_words)
    
    return df

df = pd.DataFrame({'Text': ['This is a sample sentence.', 'Another example of text.', 'Just one more.']})
df = add_word_count_column(df)
print(df)

                         Text  Word_Count
0  This is a sample sentence.           5
1    Another example of text.           4
2              Just one more.           3

In [43]:
# How are DataFrame.size() and DataFrame.shape() different?
data  = {'A':[1,2,3],
          'B':[4,5,6]}
df = pd.DataFrame(data)
df.size
#size provide total no of element

6

In [46]:
data1 = {'A':[1,2,3],
         'B':[4,5,6]}
df = pd.DataFrame(data1)
shape = df.shape
# but here shape provide total number of row and column

In [47]:
shape

(3, 2)

In [48]:
#Q6. Which function of pandas do we use to read an excel file?
      #pd.read_excel()

In [49]:
#Q 7.You have a Pandas DataFrame df that contains a column named 'Email' that contains email
# addresses in the format 'username@domain.com'. Write a Python function that creates a new column
# 'Username' in df that contains only the username part of each email address.

In [52]:
df = pd.DataFrame({'Email':['user1@gmail.com','user1@gmail.com','user1@gmail.com']})

In [53]:
df

             Email
0  user1@gmail.com
1  user1@gmail.com
2  user1@gmail.com

In [63]:
df['Email'].str.split('@').str[0]

0    user1
1    user1
2    user1
Name: Email, dtype: object

In [ ]:
def extract_username(df)

In [1]:
# Q.8 You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
# all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
# function should return a new DataFrame that contains only the selected rows.
# For example, if df contains the following values:
# A B C
# 0 3 5 1
# 1 8 2 7
# 2 6 9 4
# 3 2 3 5
# 4 9 1 2

In [4]:
data = {
        'A':[3,8,6,2,9],
        'B':[5,2,9,3,1],
        'C':[1,7,4,5,2]
}

In [6]:
df = pd.DataFrame(data)

In [28]:
def select_rows(df):
    # Create a boolean mask for the conditions
    condition = (df['A'] > 5) & (df['B'] < 10)
    
    # Use the mask to select rows that meet the conditions
    selected_df = df[condition]
    
    return selected_df

In [29]:
select_rows = select_rows(df)

In [30]:
select_rows

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [31]:
# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
# median, and standard deviation of the values in the 'Values' column.

In [33]:
df = pd.DataFrame({'Value':[10,15,20,25,30]})

In [36]:
df['Value'].mean()

20.0

In [37]:
def calculate_statistics(df):
    mean_val = df['Value'].mean()
    median_val = df['Value'].median()
    std_val = df['Value'].std()
    return mean_val,median_val,std_val

In [38]:
calculate_statistics(df)

(20.0, 20.0, 7.905694150420948)

In [39]:
# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
# create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
# for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
# should include the current day.

In [40]:
 df = pd.DataFrame({'Date': ['2023-09-01', '2023-09-02', '2023-09-03', '2023-09-04', '2023-09-05', '2023-09-06', '2023-09-07'],
                    'Sales': [100, 150, 200, 120, 180, 250, 300]})

In [41]:
df

         Date  Sales
0  2023-09-01    100
1  2023-09-02    150
2  2023-09-03    200
3  2023-09-04    120
4  2023-09-05    180
5  2023-09-06    250
6  2023-09-07    300

In [46]:
df.sort_values(by='Date',inplace = True)

In [47]:
df

         Date  Sales
0  2023-09-01    100
1  2023-09-02    150
2  2023-09-03    200
3  2023-09-04    120
4  2023-09-05    180
5  2023-09-06    250
6  2023-09-07    300

In [50]:
df['Sales'].rolling(window=7, min_periods=1).mean()

0    100.000000
1    125.000000
2    150.000000
3    142.500000
4    150.000000
5    166.666667
6    185.714286
Name: Sales, dtype: float64

In [53]:
def calculate_moving_average(df):
    df.sort_values(by='Date',inplace = True)
    df['mivingAvg']=df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

In [56]:
calculate_moving_average(df)

         Date  Sales   mivingAvg
0  2023-09-01    100  100.000000
1  2023-09-02    150  125.000000
2  2023-09-03    200  150.000000
3  2023-09-04    120  142.500000
4  2023-09-05    180  150.000000
5  2023-09-06    250  166.666667
6  2023-09-07    300  185.714286

In [57]:
# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
# column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
# Monday, Tuesday) corresponding to each date in the 'Date' column.
# For example, if df contains the following values:
# Date
# 0 2023-01-01
# 1 2023-01-02
# 2 2023-01-03
# 3 2023-01-04
# 4 2023-01-05

In [58]:
df = pd.DataFrame({'Date':['2023-01-01', '2023-01-02', '2023-01-03' , '2023-01-04' , '2023-01-05']})

In [59]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [63]:
def add_weekday_column(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df

In [64]:
df = add_weekday_column(df)

In [65]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [66]:
# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
# function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [67]:
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-15', '2023-01-31', '2023-02-05', '2023-03-10']})

In [69]:
def select_rows_in_date_range(df):
    df['Date'] = pd.to_datetime(df['Date'])
    start_data= pd.Timestamp('2023-01-01')
    end_data = pd.Timestamp('2023-01-31')
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    selected_df = df[mask]
    return selected_df

In [70]:
select_rows_in_date_range(df)

NameError: name 'start_date' is not defined